# Реалізуйте функцію, яка створює та використовує кеш для зберігання 
# і повторного використання вже обчислених значень чисел Фібоначчі

def caching_fibonacci():
    cache = {}                 # створимо порожній словник для збереження обчислень
    def fibonacci(n):          # створимо внутрішню функцію 
        # здійснимо перевірку на цифри 0 та 1
        if n <= 0:
            return 0
        if n == 1:
            return 1
        # перевіримо, чи обчислювалось це число раніше
        if n in cache:
            # якщо так, то негайно повернемо результат із словника
            return cache[n]
        
        # Якщо значення відсутнє у кеші, воно обчислюється рекурсивно і зберігається у cache
        cache[n] = fibonacci(n - 1) + fibonacci(n - 2)
        return cache[n]

    return fibonacci

fib = caching_fibonacci()
print(fib(10))  # Виведе 55
print(fib(15))  # Виведе 610
